Revit 2027 API
ParameterTypeId.DivisionSketchCurveDivisionParamsOverrideParam Property
 "Profile Override"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DivisionSketchCurveDivisionParamsOverrideParam { get; }
Public Shared ReadOnly Property DivisionSketchCurveDivisionParamsOverrideParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DivisionSketchCurveDivisionParamsOverrideParam {
	ForgeTypeId^ get ();
}
static member DivisionSketchCurveDivisionParamsOverrideParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace